bench-results/slimio_redis_fdp_enabled_everysec/summary_3.txt
====== SET ======
  28835840 requests completed in 590.75 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.143 milliseconds (cumulative count 2)
50.000% <= 0.839 milliseconds (cumulative count 14573004)
75.000% <= 1.087 milliseconds (cumulative count 21682215)
87.500% <= 1.311 milliseconds (cumulative count 25243546)
93.750% <= 1.511 milliseconds (cumulative count 27072583)
96.875% <= 1.671 milliseconds (cumulative count 27959056)
98.438% <= 1.807 milliseconds (cumulative count 28393788)
99.219% <= 1.943 milliseconds (cumulative count 28615348)
99.609% <= 2.095 milliseconds (cumulative count 28723982)
99.805% <= 2.295 milliseconds (cumulative count 28780051)
99.902% <= 2.519 milliseconds (cumulative count 28807913)
99.951% <= 2.767 milliseconds (cumulative count 28821786)
99.976% <= 3.247 milliseconds (cumulative count 28828824)
99.988% <= 3.751 milliseconds (cumulative count 28832333)
99.994% <= 5.055 milliseconds (cumulative count 28834083)
99.997% <= 11.231 milliseconds (cumulative count 28834960)
99.998% <= 23.983 milliseconds (cumulative count 28835400)
99.999% <= 50.879 milliseconds (cumulative count 28835620)
100.000% <= 836.095 milliseconds (cumulative count 28835740)
100.000% <= 2375.679 milliseconds (cumulative count 28835790)
100.000% <= 2449.407 milliseconds (cumulative count 28835820)
100.000% <= 2451.455 milliseconds (cumulative count 28835840)
100.000% <= 2451.455 milliseconds (cumulative count 28835840)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.005% <= 0.207 milliseconds (cumulative count 1484)
0.415% <= 0.303 milliseconds (cumulative count 119672)
3.491% <= 0.407 milliseconds (cumulative count 1006733)
8.787% <= 0.503 milliseconds (cumulative count 2533683)
20.679% <= 0.607 milliseconds (cumulative count 5963067)
33.388% <= 0.703 milliseconds (cumulative count 9627658)
46.463% <= 0.807 milliseconds (cumulative count 13398065)
58.147% <= 0.903 milliseconds (cumulative count 16767109)
68.457% <= 1.007 milliseconds (cumulative count 19740194)
76.392% <= 1.103 milliseconds (cumulative count 22028262)
82.772% <= 1.207 milliseconds (cumulative count 23867933)
87.220% <= 1.303 milliseconds (cumulative count 25150535)
90.973% <= 1.407 milliseconds (cumulative count 26232750)
93.689% <= 1.503 milliseconds (cumulative count 27016044)
95.913% <= 1.607 milliseconds (cumulative count 27657201)
97.398% <= 1.703 milliseconds (cumulative count 28085443)
98.467% <= 1.807 milliseconds (cumulative count 28393788)
99.065% <= 1.903 milliseconds (cumulative count 28566092)
99.436% <= 2.007 milliseconds (cumulative count 28673095)
99.624% <= 2.103 milliseconds (cumulative count 28727477)
99.971% <= 3.103 milliseconds (cumulative count 28827440)
99.991% <= 4.103 milliseconds (cumulative count 28833152)
99.994% <= 5.103 milliseconds (cumulative count 28834106)
99.995% <= 6.103 milliseconds (cumulative count 28834433)
99.995% <= 7.103 milliseconds (cumulative count 28834520)
99.996% <= 8.103 milliseconds (cumulative count 28834595)
99.996% <= 9.103 milliseconds (cumulative count 28834656)
99.996% <= 10.103 milliseconds (cumulative count 28834761)
99.997% <= 11.103 milliseconds (cumulative count 28834941)
99.997% <= 12.103 milliseconds (cumulative count 28834990)
99.997% <= 13.103 milliseconds (cumulative count 28835090)
99.997% <= 14.103 milliseconds (cumulative count 28835094)
99.998% <= 15.103 milliseconds (cumulative count 28835140)
99.998% <= 16.103 milliseconds (cumulative count 28835158)
99.998% <= 17.103 milliseconds (cumulative count 28835190)
99.998% <= 19.103 milliseconds (cumulative count 28835234)
99.998% <= 20.111 milliseconds (cumulative count 28835240)
99.998% <= 21.103 milliseconds (cumulative count 28835264)
99.998% <= 22.111 milliseconds (cumulative count 28835311)
99.998% <= 23.103 milliseconds (cumulative count 28835340)
99.999% <= 24.111 milliseconds (cumulative count 28835427)
99.999% <= 25.103 milliseconds (cumulative count 28835440)
99.999% <= 29.103 milliseconds (cumulative count 28835458)
99.999% <= 30.111 milliseconds (cumulative count 28835490)
99.999% <= 33.119 milliseconds (cumulative count 28835525)
99.999% <= 34.111 milliseconds (cumulative count 28835540)
99.999% <= 44.127 milliseconds (cumulative count 28835584)
99.999% <= 45.119 milliseconds (cumulative count 28835590)
99.999% <= 51.103 milliseconds (cumulative count 28835626)
99.999% <= 52.127 milliseconds (cumulative count 28835640)
99.999% <= 177.151 milliseconds (cumulative count 28835675)
99.999% <= 178.175 milliseconds (cumulative count 28835690)
100.000% <= 833.535 milliseconds (cumulative count 28835711)
100.000% <= 834.559 milliseconds (cumulative count 28835719)
100.000% <= 835.583 milliseconds (cumulative count 28835728)
100.000% <= 836.607 milliseconds (cumulative count 28835740)
100.000% <= 2373.631 milliseconds (cumulative count 28835773)
100.000% <= 2375.679 milliseconds (cumulative count 28835790)
100.000% <= 2449.407 milliseconds (cumulative count 28835820)
100.000% <= 2451.455 milliseconds (cumulative count 28835840)
100.000% <= 2451.455 milliseconds (cumulative count 28835840)

Summary:
  throughput summary: 48812.09 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.907     0.136     0.839     1.567     1.895  2451.455