bench-results/slimio_redis_fdp_enabled_everysec/summary_4.txt
====== SET ======
  28835840 requests completed in 569.75 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.143 milliseconds (cumulative count 4)
50.000% <= 0.783 milliseconds (cumulative count 14470708)
75.000% <= 1.095 milliseconds (cumulative count 21747015)
87.500% <= 1.327 milliseconds (cumulative count 25262931)
93.750% <= 1.511 milliseconds (cumulative count 27072239)
96.875% <= 1.663 milliseconds (cumulative count 27964373)
98.438% <= 1.799 milliseconds (cumulative count 28397017)
99.219% <= 1.943 milliseconds (cumulative count 28616628)
99.609% <= 2.119 milliseconds (cumulative count 28726209)
99.805% <= 2.335 milliseconds (cumulative count 28780225)
99.902% <= 2.551 milliseconds (cumulative count 28807935)
99.951% <= 2.791 milliseconds (cumulative count 28821836)
99.976% <= 3.263 milliseconds (cumulative count 28828841)
99.988% <= 3.999 milliseconds (cumulative count 28832335)
99.994% <= 6.263 milliseconds (cumulative count 28834082)
99.997% <= 13.359 milliseconds (cumulative count 28834962)
99.998% <= 40.831 milliseconds (cumulative count 28835400)
99.999% <= 711.679 milliseconds (cumulative count 28835640)
100.000% <= 1302.527 milliseconds (cumulative count 28835740)
100.000% <= 1963.007 milliseconds (cumulative count 28835790)
100.000% <= 2279.423 milliseconds (cumulative count 28835818)
100.000% <= 2281.471 milliseconds (cumulative count 28835840)
100.000% <= 2281.471 milliseconds (cumulative count 28835840)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.015% <= 0.207 milliseconds (cumulative count 4386)
1.323% <= 0.303 milliseconds (cumulative count 381537)
9.567% <= 0.407 milliseconds (cumulative count 2758710)
20.414% <= 0.503 milliseconds (cumulative count 5886485)
32.476% <= 0.607 milliseconds (cumulative count 9364798)
42.425% <= 0.703 milliseconds (cumulative count 12233672)
52.455% <= 0.807 milliseconds (cumulative count 15125935)
60.949% <= 0.903 milliseconds (cumulative count 17575088)
69.240% <= 1.007 milliseconds (cumulative count 19965936)
75.929% <= 1.103 milliseconds (cumulative count 21894836)
81.946% <= 1.207 milliseconds (cumulative count 23629694)
86.578% <= 1.303 milliseconds (cumulative count 24965405)
90.698% <= 1.407 milliseconds (cumulative count 26153617)
93.672% <= 1.503 milliseconds (cumulative count 27011042)
96.037% <= 1.607 milliseconds (cumulative count 27693066)
97.523% <= 1.703 milliseconds (cumulative count 28121441)
98.538% <= 1.807 milliseconds (cumulative count 28414282)
99.088% <= 1.903 milliseconds (cumulative count 28572845)
99.421% <= 2.007 milliseconds (cumulative count 28668762)
99.598% <= 2.103 milliseconds (cumulative count 28719927)
99.971% <= 3.103 milliseconds (cumulative count 28827434)
99.989% <= 4.103 milliseconds (cumulative count 28832557)
99.992% <= 5.103 milliseconds (cumulative count 28833649)
99.994% <= 6.103 milliseconds (cumulative count 28834005)
99.995% <= 7.103 milliseconds (cumulative count 28834284)
99.995% <= 8.103 milliseconds (cumulative count 28834401)
99.995% <= 9.103 milliseconds (cumulative count 28834464)
99.995% <= 10.103 milliseconds (cumulative count 28834537)
99.996% <= 11.103 milliseconds (cumulative count 28834638)
99.996% <= 12.103 milliseconds (cumulative count 28834786)
99.997% <= 13.103 milliseconds (cumulative count 28834912)
99.997% <= 14.103 milliseconds (cumulative count 28834995)
99.997% <= 17.103 milliseconds (cumulative count 28834996)
99.997% <= 18.111 milliseconds (cumulative count 28835036)
99.997% <= 19.103 milliseconds (cumulative count 28835045)
99.997% <= 20.111 milliseconds (cumulative count 28835053)
99.998% <= 21.103 milliseconds (cumulative count 28835195)
99.998% <= 22.111 milliseconds (cumulative count 28835239)
99.998% <= 23.103 milliseconds (cumulative count 28835240)
99.998% <= 25.103 milliseconds (cumulative count 28835275)
99.998% <= 26.111 milliseconds (cumulative count 28835306)
99.998% <= 27.103 milliseconds (cumulative count 28835336)
99.998% <= 28.111 milliseconds (cumulative count 28835340)
99.998% <= 36.127 milliseconds (cumulative count 28835356)
99.998% <= 37.119 milliseconds (cumulative count 28835379)
99.998% <= 38.111 milliseconds (cumulative count 28835390)
99.998% <= 41.119 milliseconds (cumulative count 28835404)
99.999% <= 42.111 milliseconds (cumulative count 28835440)
99.999% <= 45.119 milliseconds (cumulative count 28835486)
99.999% <= 46.111 milliseconds (cumulative count 28835490)
99.999% <= 136.191 milliseconds (cumulative count 28835491)
99.999% <= 137.215 milliseconds (cumulative count 28835512)
99.999% <= 138.111 milliseconds (cumulative count 28835524)
99.999% <= 139.135 milliseconds (cumulative count 28835540)
99.999% <= 383.231 milliseconds (cumulative count 28835576)
99.999% <= 384.255 milliseconds (cumulative count 28835590)
99.999% <= 711.167 milliseconds (cumulative count 28835619)
99.999% <= 712.191 milliseconds (cumulative count 28835640)
99.999% <= 822.271 milliseconds (cumulative count 28835646)
99.999% <= 823.295 milliseconds (cumulative count 28835673)
99.999% <= 824.319 milliseconds (cumulative count 28835690)
99.999% <= 1300.479 milliseconds (cumulative count 28835691)
100.000% <= 1301.503 milliseconds (cumulative count 28835713)
100.000% <= 1302.527 milliseconds (cumulative count 28835740)
100.000% <= 1959.935 milliseconds (cumulative count 28835754)
100.000% <= 1961.983 milliseconds (cumulative count 28835761)
100.000% <= 1963.007 milliseconds (cumulative count 28835790)
100.000% <= 2279.423 milliseconds (cumulative count 28835818)
100.000% <= 2281.471 milliseconds (cumulative count 28835840)
100.000% <= 2281.471 milliseconds (cumulative count 28835840)

Summary:
  throughput summary: 50611.03 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.863     0.136     0.783     1.559     1.887  2281.471